Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་རྒྱལ་བས་དགྱེས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སེམས་སྦྱངས་པ་ཞེས་བྱ། །
en: The thus-gone Jayanandin Will be born in a place called Purified Mind.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཡོད་ཡབ་ནི་ས་ག་ཡིན། །དགྲ་བཅོམ་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend six leagues. Saga will be his father, and Joyous Worthy One will be this victor’s mother.

source: སྲས་པོ་མཆོད་ལེགས་གཉིད་སངས་རིམ་གྲོ་པ། །
en: Excellent Worship will be his son and Awoken from Sleep his attendant.

source: ཕས་ཀྱི་རྒོལ་བ་འཇོམས་པ་མཁས་པ་སྟེ། །
en: Crusher of Attacks will be the scholar

source: འཇིག་རྟེན་བཀྲ་ཤིས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Auspicious World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་རྩ་གསུམ་སྟེ། །ཀུན་ལའང་སྲིད་པ་ཀུན་ལ་མ་ཆགས་པ། །བྱེ་བ་ཕྲག་ནི་གཉིས་གཉིས་ཡོད་པར་འགྱུར། །
en: There will be eighty-three consecutive congregations, Each of them gathering twenty million Who are detached from all of existence.

source: མི་ཚེ་ལོ་གྲངས་བྱེ་བ་སུམ་ཅུ་གཉིས། །
en: “The lifespan of humans will be three hundred twenty million years,

source: རྒྱལ་བ་མྱ་ངན་འདས་ཀྱང་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བར་ཐེ་ཚོམ་མེད་པར་གནས། །
en: And after this victorious one has attained nirvāṇa His sacred Dharma will without a doubt remain ten million years.

source: མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་ཕྲག་གཉིས་ཏེ། །ན་བཟའ་བརྒྱ་སྟོང་སྙེད་ཀྱིས་རྣམ་པར་བརྒྱན། །
en: The stūpas will number two billion “And be adorned with hundreds of thousands of fabrics.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་འོད་ཟེར་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་དྲག་ཤུལ་ངེས་ཞེས་བྱ། །
en: The thus-gone Siṃharaśmi Will be born in a place called Certainly Fierce.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཡབ་ནི་གྲོགས་བཟང་ཡིན། །དོན་ལྡན་ང་རོ་ཞེས་བྱ་ཡུམ་ཡང་ཡིན། །
en: The family of this victor will be brahmin, “And his light will extend ten million leagues. Excellent Companion will be his father and Meaningful Roar his mother.

source: སྲས་པོ་དོན་ལྡན་དོན་ཆེན་རིམ་གྲོ་པ། །
en: Meaningful will be his son and Great Meaning his attendant.

source: དགེ་བ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Joy in Virtue will be the scholar

source: བདག་བརྟགས་པ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Imaginary Self the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བདུན་ཅུ་སྟེ། །ཐམས་ཅད་ལ་ཡང་ང་རྒྱལ་སྤངས་པ་པོ། །བྱེ་བ་སྟོང་ཕྲག་དག་ནི་མཐའ་ཡང་ཡས། །
en: There will be seventy consecutive congregations, Each of them gathering limitless billions Who have abandoned pride.

source: མི་ཚེ་ལོ་གྲངས་ཆིག་ཁྲི་བཞི་སྟོང་ཡིན། །
en: “The lifespan of humans will be fourteen thousand years,

source: རྒྱལ་བའི་དམ་ཆོས་ལོ་གྲངས་ཆིག་ཁྲི་དང་། །གཞན་ཡང་སུམ་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And the victorious one’s sacred Dharma Will remain for ten thousand plus thirty-six thousand further years.

source: མཆོད་རྟེན་བྱེ་བ་ཕྲག་ནི་སྟོང་སྙེད་དེ། །གསེར་གྱི་རྒྱལ་མཚན་དག་གིས་འཁོར་བར་བསྐོར། །
en: There will be ten billion stūpas “Surrounded by golden banners.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་ཚད་མེད་ཡིན། །
en: The thus-gone Vairocana Will be born in a place called Infinite Fame.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཡབ་ནི་ལྷ་ལེགས་ཡིན། །མི་ཡིས་མཆོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend ten million leagues. Divine Excellence will be his father, and Worshiped by Humanity will be this victor’s mother.

source: སྲས་པོ་དགའ་བྱེད་བརྟན་ལྡན་རིམ་གྲོ་པ། །
en: Instiller of Joy will be his son and Steadfast his attendant.

source: དཔའ་བརྟན་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Heroic Courage will be the scholar

source: མཐུ་རྩལ་ནོར་གནས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Abiding in Precious Strength the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཏེ་དགྲ་བཅོམ་གྲངས། །བྱེ་བ་ཕྲག་ནི་ཆིག་ཁྲི་ཆིག་སྟོང་དང་། །ཉིས་བརྒྱ་དྲུག་ཅུ་དག་ནི་འབྱུང་བར་འགྱུར། །
en: There will be seven consecutive congregations, Each of them gathering Twenty-six quadrillion worthy ones.

source: སྐུ་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: “His lifespan will be twenty-two thousand years,

source: རྒྱལ་བའི་དམ་པའི་ཆོས་ནི་ལོ་གྲངས་དག །ཆིག་ཁྲི་བདུན་སྟོང་བར་དུ་གནས་རྒྱལ་བའི། །སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་གཉིས་པ་གཅིག །ནོར་བུའི་དྲ་བ་དག་གིས་རྣམ་པར་བརྒྱན། །
en: And this victorious one’s sacred Dharma Will remain for seventeen thousand years. This victor’s relics will be contained in one stūpa measuring two leagues “And adorned with jewel nets.

source: ཐ་བ་མེད་པ་གྲགས་པ་མཆོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པའི་འོད་ཅེས་བྱ། །
en: Yaśottara who is free from defilements Will be born in a place called Light of Fame.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ཕྲེང་བཟངས་ཡིན། །མེ་ཏོག་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend one hundred leagues. Excellent Garland will be his father, and Flower Joy will be this victor’s mother.

source: སྲས་པོ་རྒྱལ་བྱིན་ལྷ་བཟངས་རིམ་གྲོ་པ། །
en: Royal Gift will be his son and Divine Excellence his attendant.

source: སྲིད་པ་གཡོ་བར་བྱེད་པ་མཁས་པ་སྟེ། །
en: Shaker of Existence will be the scholar

source: ཐེ་ཚོམ་རྣམ་པར་འཇིག་པ་རྫུ་འཕྲུལ་ཅན། །
en: “And Destroyer of Doubt the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་དང་། །གཞན་ཡང་ལན་གྲངས་ཉི་ཤུ་རྩ་བཞི་སྟེ། །འདུས་པ་ཀུན་ལའང་བྱེ་བ་སྟོང་སྟོང་ཡོད། །
en: There will be sixty-six consecutive congregations, And then again twenty-four, Each of them gathering ten billion.

source: མི་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: “The lifespan of humans will be eighty-two thousand years,

source: དེ་ཡི་དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བཅུ་བདུན་ཚང་བའི་བར་དུ་གནས་པར་འགྱུར། །
en: And this teacher’s sacred Dharma Will remain complete for seventeen thousand years.

source: སྐུ་གདུང་དག་ནི་རྣམ་པར་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་དག་གི་གྲངས་ནི་བརྒྱ་ཡང་ཡིན། །
en: This victor’s relics will be abundant, “And there will be one hundred stūpas.

source: མི་ཡི་འདྲེན་པ་ཐུགས་རབ་གཞུངས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་བལྟ་ཞེས་བྱ། །
en: The guide of humans, Sumedhas, Will be born in a place called Wisdom View.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་སྒྲོན་མ་ཡིན། །བྱང་ཆུབ་ཡན་ལག་དགའ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend five leagues. Lamp will be his father, and Joy in Factors of Awakening will be this victor’s mother.

source: སྲས་པོ་ཤེད་བུ་དགེ་བཟང་རིམ་གྲོ་པ། །
en: Human will be his son and Excellent Virtue his attendant.

source: ཡེ་ཤེས་སྟོབས་མཆོག་ལྡན་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Possessor of the Supreme Power of Wisdom the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་རྩ་དྲུག་སྟེ། །འཇིག་རྟེན་རྒོལ་བ་རབ་འཇོམས་གཡོ་མེད་ལ། །ཁ་གསག་མེད་པའི་དགྲ་བཅོམ་ཤ་སྟག་འདུས། །
en: There will be eighty-six consecutive congregations, Each of them consisting exclusively of worthy ones Who destroy the world’s attacks without deceit or pretense.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་ཁྲི་ཡང་ཡིན། །
en: “The lifespan of humans will be ten thousand years,

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཆིག་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And once this teacher has accomplished exhaustion His sacred Dharma will remain for twelve thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་གྲངས་ནི་བྱེ་བ་དགུར་ཡང་ཚང་། །
en: This victor’s relics will be abundant, “And the amount of stūpas will reach ninety million.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བུ་ཟླ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མིག་གིས་མཐོང་ཞེས་བྱ། །
en: The thus-gone one, Maṇicandra, Will be born in a place called Seen with the Eyes.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་འོད་ཟེར་བཟང་པོ་ཡབ། །གྲགས་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, “And his light will extend ten leagues. Excellent Light Rays will be his father, and Endowed with Fame will be this victor’s mother.

source: སྲས་པོ་ཆོས་འདོད་སྐར་རྒྱལ་རིམ་གྲོ་པ། །
en: Dharma Wish will be his son and Star King his attendant.

source: འགྲོ་བ་ལྟ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Seeing the World will be the scholar

source: མཛའ་ཡི་གསལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Clarity of Friendship the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ལེགས་རྟོགས་སེམས་ལྡན་ཚུལ་ཁྲིམས་མཚུངས་པ་པོ། །དགྲ་བཅོམ་བྱེ་བ་ཕྲག་ནི་བརྒྱ་བརྒྱ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering one billion worthy ones Endowed with excellent realization and equal in terms of discipline.

source: མི་ཚེ་ལོ་གྲངས་ཆིག་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: “The lifespan of humans will be twelve thousand years,

source: རྒྱལ་བ་སྲིད་པ་ཞི་བར་གྱུར་པ་ཡི། །དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་ཡང་གནས། །
en: And once this victor has pacified existence His sacred Dharma will remain for ten thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དྲུག་ཅུ་རྩ་གཉིས་ཏེ། །གདུགས་གྲངས་ཆིག་ཁྲི་དྲུག་སྟོང་དག་གིས་བརྒྱན། །
en: There will be sixty-two stūpas of this victor, “Adorned with sixteen thousand parasols.

source: དེ་བཞིན་གཤེགས་པ་དྲག་ཤུལ་འོད་ཟེར་གྱི། །སྐྱེ་ཡུལ་འོད་ནི་རྟག་པ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Ugraprabha Will be born in a place called Constant Light.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །གླིང་བཞི་པ་ཙམ་བརྒྱད་ཡོད་དབྱངས་སྙན་ཡབ། །རྒྱལ་ལྡན་མ་ནི་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཁ་ལོ་སྒྱུར་ཡིན་དབྱེར་མེད་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, “And his light will cover eight times the extent of the four continents. Melody will be his father and Victorious his mother. Leader will be his son and Inseparable his attendant.

source: འགྲོས་མཁས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Expertise will be the scholar

source: འཇིག་རྟེན་པ་ཡིས་བསྔགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: “And Praised by the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་དེ་ཀུན་ལ་ཡང་། །ང་མེད་ཕུང་པོར་འཛིན་པ་སྤངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བཅུ་བཞི་བཅུ་བཞི་ཡོད། །
en: There will be eight consecutive congregations, Each of them gathering one hundred forty million selfless ones Who have given up grasping at the aggregates.

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བཞི་བཅུ་རྩ་དྲུག་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain For forty-six thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བཟང་པོའི་གྲངས། །བྱེ་བ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་འབྱུང་། །
en: The relics will be abundant, and the fine stūpas “Will number two hundred twenty billion.

source: དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་ཐུབ་མེད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བས་ཚིམ་ཞེས་བྱ། །
en: The thus-gone Anihatavrata Will be born in a place called Filled with Joy.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡིན་ཡབ་ནི་ལྷ་དབང་ཡིན། །ས་བདག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend ten leagues. Divine King will be his father, and Lady of the Land will be this victor’s mother.

source: སྲས་པོ་བྱམས་པ་ལེགས་བྱམས་རིམ་གྲོ་པ། །
en: Love will be his son and Strong Love his attendant.

source: བློ་མཚུངས་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Equal Wisdom will be the scholar

source: ལེགས་ངེས་ཐོབ་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Attainer of Excellent Certainty the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཅིག་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་བྱེ་ཕྲག་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །ལྷག་པ་གཞན་ཡང་བརྒྱད་སྟོང་བརྒྱད་སྟོང་ཡིན། །
en: There will be eleven consecutive congregations, Each of them gathering nine hundred twenty million worthy ones As well as eight thousand extraordinary others.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་ཡིན། །
en: “The lifespan of humans will be seventy thousand years,

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །དྲུག་ཅུ་རྩ་དགུའི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain For sixty-nine thousand years.

source: མཆོད་རྟེན་གྲངས་ནི་བྱེ་བ་ཕྲག་བརྒྱ་དང་། །ལྷག་ཀྱང་རྩ་ལྔ་གསེར་གྱི་རྒྱལ་མཚན་ཅན། །
en: The stūpas will number one billion fifty million “And be adorned with golden banners.

source: འོད་དང་ལྡན་པ་འགྲོ་བས་མཆོད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སེམས་སྦྱངས་པ་ཞེས་བྱ། །
en: The lustrous Jagatpūjita Will be born in a place called Purified Mind.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་བྱམས་ལེགས་ཡིན། །བློ་གྲོས་གྲགས་མ་ཡུམ་ཡིན་སྲས་པོ་ནི། །རིན་ཆེན་རིན་ཆེན་བཟང་པོ་རིམ་གྲོ་པ། །
en: His family will be brahmin, “And his light will extend twenty-two leagues. Strong Love will be his father and Famed Intelligence his mother. Jewel will be his son and Excellent Jewel his attendant.

source: བརྟུལ་ཞུགས་ཆེན་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Great Yogic Discipline will be the scholar

source: སྐྱེས་མཆོག་དམ་པ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: “And Supreme Holy Man the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཅུ་དང་། །གཞན་ཡང་ལྷག་པ་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །བྱེ་བ་སྟོང་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་ཡོད། །
en: There will be eighty consecutive congregations, Along with twenty-two more, Each of them gathering one hundred eighty billion.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་ཡིན། །
en: “The lifespan of humans will be seventy-four thousand years,

source: མཆོད་པའི་གནས་ཀྱི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་དུ་གནས་ཤིང་སྐུ་གདུང་རྒྱས། །
en: And the sacred Dharma of this true object of worship Will remain for one thousand years.

source: མཆོད་རྟེན་གྲངས་ནི་བརྒྱད་ཁྲི་ཉིས་སྟོང་སྟེ། །རིན་ཆེན་སྤྲས་ཤིང་འགྲོ་བ་དག་གིས་བརྒྱན། །
en: The relics will be abundant and there will be eighty-two thousand stūpas “Studded with jewels and adorned with living beings.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བུའི་ཚོགས་སྐྱེ་བའི། །ཡུལ་ནི་གཟི་བྱིན་ཀུན་ལས་འཕགས་ཞེས་བྱ། །
en: The thus-gone Maṇigaṇa Will be born in a place called Unparalleled Splendor.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་དྲང་སྲོང་དབང་པོ་ཡབ། །ལྷ་དགའ་ཞེས་ནི་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: His family will be brahmin, “And his light will extend seventy leagues. Lord of Sages will be his father and Divine Joy his mother.

source: སྲས་པོ་ལྷ་ཡིན་ལྷ་བཟང་རིམ་གྲོ་པ། །
en: Divine will be his son and Divine Excellence his attendant.

source: མི་ཡི་དབང་ཕྱུག་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: Lord of Humans will be the scholar

source: ཆགས་མེད་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Abiding in Nonattachment the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་སོ་སོ་ཡང་དག་རིག་ཅེས་པའི། །ཕ་རོལ་ཕྱིན་པ་ཐེར་འབུམ་ཐེར་འབུམ་ཡོད། །
en: There will be seventy-six consecutive congregations, Each of them gathering one billion Who have perfected the types of correct knowledge.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: “The lifespan of humans will be seventy-two thousand years,

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བཞི་བཅུར་ཚང་བའི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain complete For forty thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་བྱེ་བ་ཕྲག་བཅུ་སྟེ། །གསེར་གྱི་པད་མ་དག་གིས་འཁོར་བར་བསྐོར། །
en: There will be one hundred million stūpas of this victor, “Surrounded by golden lotuses.

source: དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་བླ་མ་ཡི། །སྐྱེ་ཡུལ་བསོད་ནམས་ཡང་དག་འཕགས་ཞེས་བྱ། །
en: The thus-gone Lokottara Will be born in a place called Truly Superior Merit.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་བརྒྱད་ཅུ་ཡབ་ནི་དཔལ་ལྡན་ཡིན། །ཕྱོགས་ལྷ་ཞེས་ནི་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, “And his light will extend eight hundred million leagues. Glorious will be this victor’s father and Divine Purity his mother.

source: སྲས་པོ་པད་མ་བློ་བཟངས་རིམ་གྲོ་པ། །
en: Lotus will be his son and Excellent Mind his attendant.

source: ཀུན་ཏུ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Universal Joy will be the scholar

source: ཡེ་ཤེས་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Light of Wisdom the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱ་ནི་དྲུག་ཅུ་སྟེ། །ཀུན་ལའང་ལྷག་མེད་མྱ་ངན་འདས་ཕྱིན་པ། །དགྲ་བཅོམ་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: There will be six thousand consecutive congregations, Each of them gathering ten billion worthy ones, Who will reach the nirvāṇa without remainder.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉིས་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma of the one gone to cessation Will remain for two thousand years.

source: མཆོད་རྟེན་དགུ་བཅུ་རྩ་བཞིར་ཚང་བ་སྟེ། །རིན་ཆེན་རང་བཞིན་ལན་ཀན་དག་གིས་བརྒྱན། །
en: There will be ninety-four stūpas “Adorned with jewel fences.

source: དེ་བཞིན་གཤེགས་པ་གླང་ཆེན་སེང་གེ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མདངས་སྡུག་པ་ཞེས་བྱ། །
en: The thus-gone Siṃhahastin Will be born in a place called Lovely Radiance.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་མཆོད་སྦྱིན་བཟང་པོ་ཡབ། །འགྲོ་དགའ་རྒྱལ་བའི་ཡུམ་ཡིན་སྲས་པོ་ནི། །མེ་ཏོག་མེ་ཏོག་བཟང་པོ་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, “And his light will extend nine leagues. Excellent Sacrifice will be his father, and Joyous World will be this victor’s mother. Flower will be his son and Excellent Flower his attendant.

source: མཆོད་པར་འོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Worthy of Worship will be the scholar

source: ལྷ་ཡིས་ཕྱག་བྱས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Venerated by Gods the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཤིན་ཏུ་ངེས་པའི་ཤེས་རབ་ལྡན་པ་པོ། །དགྲ་བཅོམ་སེམས་སྦྱངས་བྱེ་བ་སྟོང་སྟོང་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering ten billion worthy ones Whose minds are purified and endowed with insight of tremendous certainty.

source: དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བྱེ་བ་ཕྲག །ལྔ་དག་ཚང་བའི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma will remain Intact for fifty million years.

source: རྒྱལ་བའི་སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་གྲངས། །ཐེར་འབུམ་ཕྲག་གཅིག་ཆིག་འབུམ་ལྔ་སྟོང་ཡོད། །
en: The relics of this victor will be abundant, “And there will be one billion one hundred and five thousand stūpas.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་སྙིང་པོ་རྟག་ཏུ་བརྟན་ཞེས་བྱ། །
en: The thus-gone Candra Will be born in a place called Ever Stable Essence.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཅིག་ཡོད་སཱ་ལའི་དབང་པོ་ཡབ། །ཡོན་ཏན་སྨྲ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, “And his light will extend one league. Lord of Sālas will be his father, and Teacher of Qualities will be this victor’s mother.

source: སྲས་པོ་ཆོས་སྦྱིན་ཆོས་བཟངས་རིམ་གྲོ་པ། །
en: Dharma Gift will be his son and Excellent Dharma his attendant.

source: རབ་ཏུ་ཞི་དགའ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Serene Joy will be the scholar

source: འཇིག་རྟེན་མི་གནས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Not Dwelling in the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་དེ་ཀུན་ལ་ཡང་། །ཤེས་རབ་ལེགས་བསྒོམས་ཕ་རོལ་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be eight consecutive congregations, Each of them gathering two hundred twenty million Who have perfected the cultivation of insight.

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma will remain for the benefit of beings, Likewise for seventy-four thousand years.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་ཕྲག་གཉིས་འབྱུང་། །
en: After this knower of the world has attained nirvāṇa “There will be two billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་ཟེར་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཤེས་རབ་སྣང་ཞེས་བྱ། །
en: The thus-gone Ratnārci Will be born in a place called Light of Insight.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་གསུམ་ཡོད་ཡབ་ནི་ཆུ་དབང་པོ། །དགེ་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, “And his light will extend seventy-three leagues. Water King will be his father, and Virtuous will be this victor’s mother.

source: སྲས་པོ་རིག་དགའ་ལྷ་ནི་རིམ་གྲོ་པ། །
en: Delighting in Knowledge will be his son and Divine his attendant.

source: བློ་གྲོས་མིག་ལྡན་པ་ནི་མཁས་པ་སྟེ། །
en: Endowed with the Eye of Intelligence will be the scholar

source: ཡིད་སྦྱངས་པ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Purified Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །འཇིག་རྟེན་མ་ཆགས་རྣམ་གྲོལ་ཐོབ་པ་པོ། །འཁྲུལ་མེད་སྐྱུགས་པ་བོར་བ་ཤ་སྟག་གོ། །
en: There will be sixty-six consecutive congregations, Gathering nothing but attainers of liberation, detached from the world, Renunciants free from delusion.

source: རབ་ཏུ་ཞི་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་སྟོང་ཚང་བའི་བར་དུ་གནས། །
en: And after the teacher has gone to peace His sacred Dharma will remain complete for three thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་གསུམ་པ་ནོར་བུའི་དྲ་བས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa “Measuring three leagues and adorned with jewel nets.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་སྦེད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགེ་བས་བརྒྱན་ཞེས་བྱ། །
en: The thus-gone Rāhuguhya Will be born in a place called Adorned with Virtue.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་མཐུ་ལྡན་ཡིན། །གྲགས་པའི་བླ་མ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: His family will be brahmin, “And his light will extend twenty-two leagues. Powerful will be his father and Highest Fame his mother.

source: སྲས་པོ་ལྷ་དགའ་ཆོས་ལྡན་རིམ་གྲོ་པ། །
en: Divine Joy will be his son and Endowed with Dharma his attendant.

source: གསེར་ལྟ་བུ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Gold-Like will be the scholar

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཅུ་དང་། །གཞན་ཡང་ཉི་ཤུ་རིམས་ནད་མེད་པ་པོ། །བྱེ་བ་འབུམ་ཕྲག་ཚང་བ་ཤ་སྟག་གོ། །
en: There will be eighty consecutive congregations, followed by twenty, Each gathering trillions Who are all, without exception, free from what plagues beings.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་ཡིན། །
en: “The lifespan of humans will be seventy-six thousand years,

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་བཅུར་ནི་ཚང་བར་གནས། །
en: And the sacred Dharma of the one gone to peace Will remain intact for ten thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བཟང་པོའི་གྲངས། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་ཀྱང་ཡིན། །
en: His relics will be abundant, “And the stūpas will number two hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྒྱ་མཚོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་འོད་ཅེས་བྱ། །
en: The thus-gone Guṇasāgara Will be born in a place called Lamp of Awakening.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་པད་མ་བཟང་། །པད་མ་ཅན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, “And his light will extend thirty leagues. Excellent Lotus will be his father and Lotus Possessor his mother.

source: སྲས་པོ་པད་མ་པད་བཟངས་རིམ་གྲོ་པ། །
en: Lotus will be his son and Excellent Lotus his attendant.

source: ཡོན་ཏན་སྤོས་འོད་དེ་ནི་མཁས་པ་སྟེ། །
en: Qualities of Fragrance and Light will be the scholar

source: ཀུན་ཏུ་གསལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And All-Illuminating the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱ་སྟེ་ཀུན་ལ་ཡང་། །རྩྭ་ཤིང་མེད་པར་མཚུངས་པའི་སེམས་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be one hundred consecutive congregations, Each gathering two hundred twenty million Who have attained a mind that is, as it were, free from vegetation.

source: མི་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་བརྒྱད་སྟོང་ཡིན། །
en: “The lifespan of humans will be twenty-eight thousand years,

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And when the teacher has accomplished exhaustion His sacred Dharma will remain for eighty thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་དག་གི་གྲངས། །སྟོང་ཕྲག་བརྒྱད་ཅུ་དག་ནི་ཚང་བར་འགྱུར། །
en: His relics will be abundant, “And the number of stūpas will reach eighty thousand.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ལྡན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཁྲུལ་པ་མེད་ཅེས་བྱ། །
en: The thus-gone Sahitaraśmi Will be born in a place called Free from Delusion.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་དགེ་བཟང་ཡིན། །རིན་ཆེན་མཆོག་ཡུམ་སྲས་པོ་ཡན་ལག་གཡོ། །ཡན་ལག་སྡུག་ལྡན་པ་ནི་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, “And his light will extend twenty-two leagues. Excellent Virtue will be his father and Supreme Jewel his mother. Swaying Limbs will be his son and Endowed with Lovely Limbs his attendant.

source: རབ་ཏུ་བརྒྱན་པའི་དབྱངས་ནི་བློ་ལྡན་ཏེ། །
en: Song of Adornment will be the scholar

source: འཇིགས་པ་མེད་པའི་བློ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: “And Fearless Mind the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅྭ་བརྒྱད་ཀུན་ལ་ཡང་། །བསྒོམས་རྒྱུས་ཉོན་མོངས་ཐལ་བར་རླག་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཁྲི་སུམ་ཁྲི་ཡོད། །
en: There will be eighteen consecutive congregations, Each gathering three hundred billion Who through meditation have turned the defilements to dust.
